Tekla Open API Reference for Tekla Structures 2025
RebarMesh.CatalogName Property
 The name of the rebar mesh catalog.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string CatalogName { get; set; }
Public Property CatalogName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RebarMesh Class
Tekla.Structures.Model Namespace